Revit 2026 API

# ExternalCommandsDataAssemblyName Property

---

The assembly path of the menu item.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string AssemblyName { get; set; }
```
```vb
Public Property AssemblyName As String
	Get
	Set
```
```cpp
public:
property String^ AssemblyName {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member AssemblyName : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

The path of the assembly which contains the corresponding external command.

#### Reference

ExternalCommandsData Class

Autodesk.Revit.UI Namespace